# Parameters
num_classes: 80       # Number of classes
depth_multiple: 1.0   # Expand model depth
width_multiple: 1.25  # Expand layer channels

# anchors
anchors:
  - [ 13,17,    22,25,     27,66,     55,41]    # P3/8
  - [ 57,88,   112,69,     69,177,   136,138]   # P4/16
  - [136,138,  287,114,   134,275,   268,248]   # P5/32
  - [268,248,  232,504,   445,416,   640,640]   # P6/64
  - [812,393,  477,808,  1070,908,  1408,1408]  # P7/128

# CSP-P7 backbone
backbone:
  # [from, number, module, args]
  [
    [-1, 1,  Conv,          [32, 3, 1]],    # 0
    [-1, 1,  Conv,          [64, 3, 2]],    # 1-P1/2
    [-1, 1,  BottleneckCSP, [64]],          # 2
    [-1, 1,  Conv,          [128, 3, 2]],   # 3-P2/4
    [-1, 3,  BottleneckCSP, [128]],         # 4
    [-1, 1,  Conv,          [256, 3, 2]],   # 5-P3/8
    [-1, 15, BottleneckCSP, [256]],         # 6
    [-1, 1,  Conv,          [512, 3, 2]],   # 7-P4/16
    [-1, 15, BottleneckCSP, [512]],         # 8
    [-1, 1,  Conv,          [1024, 3, 2]],  # 9-P5/32
    [-1, 7,  BottleneckCSP, [1024]],        # 10
    [-1, 1,  Conv,          [1024, 3, 2]],  # 11-P6/64
    [-1, 7,  BottleneckCSP, [1024]],        # 12
    [-1, 1,  Conv,          [1024, 3, 2]],  # 13-P7/128
    [-1, 7,  BottleneckCSP, [1024]],        # 14
  ]

# YOLOv4-P7 head
# na = len(anchors[0])
head:
  [[-1,       1, SPPCSP,         [512]],                # 15
   [-1,       1, Conv,           [512, 1, 1]],          # 16
   [-1,       1, nn.Upsample,    [None, 2, "nearest"]], # 17
   [-6,       1, Conv,           [512, 1, 1]],          # 18-route backbone P6
   [[-1, -2], 1, Concat,         [1]],                  # 19
   [-1,       3, BottleneckCSP2, [512]],                # 20
   [-1,       1, Conv,           [512, 1, 1]],          # 21
   [-1,       1, nn.Upsample,    [None, 2, "nearest"]], # 22
   [-13,      1, Conv,           [512, 1, 1]],          # 23-route backbone P5
   [[-1, -2], 1, Concat,         [1]],                  # 24
   [-1,       3, BottleneckCSP2, [512]],                # 25
   [-1,       1, Conv,           [256, 1, 1]],          # 26
   [-1,       1, nn.Upsample,    [None, 2, "nearest"]], # 27
   [-20,      1, Conv,           [256, 1, 1]],          # 28-route backbone P4
   [[-1, -2], 1, Concat,         [1]],                  # 29
   [-1,       3, BottleneckCSP2, [256]],                # 30
   [-1,       1, Conv,           [128, 1, 1]],          # 31
   [-1,       1, nn.Upsample,    [None, 2, "nearest"]], # 32
   [-27,      1, Conv,           [128, 1, 1]],          # 33-route backbone P3
   [[-1, -2], 1, Concat,         [1]],                  # 34
   [-1,       3, BottleneckCSP2, [128]],                # 35
   [-1,       1, Conv,           [256, 3, 1]],          # 36
   [-2,       1, Conv,           [256, 3, 2]],          # 37
   [[-1, 30], 1, Concat,         [1]],                  # 38-Cat
   [-1,       3, BottleneckCSP2, [256]],                # 39
   [-1,       1, Conv,           [512, 3, 1]],          # 40
   [-2,       1, Conv,           [512, 3, 2]],          # 41
   [[-1, 25], 1, Concat,         [1]],                  # 42-Cat
   [-1,       3, BottleneckCSP2, [512]],                # 43
   [-1,       1, Conv,           [1024, 3, 1]],         # 44
   [-2,       1, Conv,           [512, 3, 2]],          # 45
   [[-1, 20], 1, Concat,         [1]],                  # 46-Cat
   [-1,       3, BottleneckCSP2, [512]],                # 47
   [-1,       1, Conv,           [1024, 3, 1]],         # 48
   [-2,       1, Conv,           [512, 3, 2]],          # 49
   [[-1, 15], 1, Concat,         [1]],                  # 50-Cat
   [-1,       3, BottleneckCSP2, [512]],                # 51
   [-1,       1, Conv,           [1024, 3, 1]],         # 52

   [[36, 40, 44, 48, 52], 1, Detect, [num_classes, anchors]], # 53-Detect(P3, P4, P5, P6, P7)
  ]
