# Parameters
num_classes: 80      # Number of classes
depth_multiple: 1.0  # Expand model depth
width_multiple: 1.0  # Expand layer channels

# Anchors
anchors:
  - [ 13,17,   31,25,   24,51,    61,45]    # P3/8
  - [ 61,45,   48,102, 119,96,    97,189]   # P4/16
  - [ 97,189, 217,184, 171,384,  324,451]   # P5/32
  - [324,451, 545,357, 616,618, 1024,1024]  # P6/64

# CSP-P6 backbone
backbone:
  # [from, number, module, args]
  [
    [-1, 1,  Conv,          [32, 3, 1]],   # 0
    [-1, 1,  Conv,          [64, 3, 2]],   # 1-P1/2
    [-1, 1,  BottleneckCSP, [64]],         # 2
    [-1, 1,  Conv,          [128, 3, 2]],  # 3-P2/4
    [-1, 3,  BottleneckCSP, [128]],        # 4
    [-1, 1,  Conv,          [256, 3, 2]],  # 5-P3/8
    [-1, 15, BottleneckCSP, [256]],        # 6
    [-1, 1,  Conv,          [512, 3, 2]],  # 7-P4/16
    [-1, 15, BottleneckCSP, [512]],        # 8
    [-1, 1,  Conv,          [1024, 3, 2]], # 9-P5/32
    [-1, 7,  BottleneckCSP, [1024]],       # 10
    [-1, 1,  Conv,          [1024, 3, 2]], # 11-P6/64
    [-1, 7,  BottleneckCSP, [1024]],       # 12
  ]

# YOLOv4-P6 head
# na = len(anchors[0])
head:
  [
    [-1,       1, SPPCSP,         [512]],                 # 13
    [-1,       1, Conv,           [512, 1, 1]],           # 14
    [-1,       1, nn.Upsample,    [None, 2, "nearest"]],  # 15
    [-6,       1, Conv,           [512, 1, 1]],           # 16-route backbone P5
    [[-1, -2], 1, Concat,         [1]],                   # 17
    [-1,       3, BottleneckCSP2, [512]],                 # 18
    [-1,       1, Conv,           [256, 1, 1]],           # 19
    [-1,       1, nn.Upsample,    [None, 2, "nearest"]],  # 20
    [-13,      1, Conv,           [256, 1, 1]],           # 21-route backbone P4
    [[-1, -2], 1, Concat,         [1]],                   # 22
    [-1,       3, BottleneckCSP2, [256]],                 # 23
    [-1,       1, Conv,           [128, 1, 1]],           # 24
    [-1,       1, nn.Upsample,    [None, 2, "nearest"]],  # 25
    [-20,      1, Conv,           [128, 1, 1]],           # 26-route backbone P3
    [[-1, -2], 1, Concat,         [1]],                   # 27
    [-1,       3, BottleneckCSP2, [128]],                 # 28
    [-1,       1, Conv,           [256, 3, 1]],           # 29
    [-2,       1, Conv,           [256, 3, 2]],           # 30
    [[-1, 23], 1, Concat,         [1]],                   # 31-Cat
    [-1,       3, BottleneckCSP2, [256]],                 # 32
    [-1,       1, Conv,           [512, 3, 1]],           # 33
    [-2,       1, Conv,           [512, 3, 2]],           # 34
    [[-1, 18], 1, Concat,         [1]],                   # 35-Cat
    [-1,       3, BottleneckCSP2, [512]],                 # 36
    [-1,       1, Conv,           [1024, 3, 1]],          # 37
    [-2,       1, Conv,           [512, 3, 2]],           # 38
    [[-1, 13], 1, Concat,         [1]],                   # 39-Cat
    [-1,       3, BottleneckCSP2, [512]],                 # 40
    [-1,       1, Conv,           [1024, 3, 1]],          # 41

    [[29, 33, 37, 41], 1, Detect, [num_classes, anchors]],  # 42-Detect(P3, P4, P5, P6)
  ]
